[
  {
    "id": 1,
    "name": "Dan Bernard",
    "title": "Professor",
    "address": "McIntyre Medical Sciences Building\n3655 Promenade Sir William Osler, Lab 1320\nMontreal, QC, H3G 1Y6",
    "tel": "514-398-2525",
    "fax": "",
    "email": "daniel.bernard@mcgill.ca",
    "site": "https://www.mcgill.ca/bernardlab/%C2%A0%C2%A0",
    "publications": "http://www.ncbi.nlm.nih.gov/pubmed?term=bernard%20dj",
    "education": "Prof. Bernard earned his Ph.D. at Johns Hopkins University and then conducted post-doctoral research in molecular endocrinology at Northwestern University. His first independent position was as a Staff Scientist at the Population Council’s Center for Biomedical Research at The Rockefeller University. He then moved his lab to McGill in April 2006.",
    "research": "The Bernard lab investigates molecular mechanisms of pituitary hormone synthesis using in vitro and in vivo approaches. Projects in the lab concern: 1) signal transduction mechanisms through which members of the transforming growth factor β superfamily regulate pituitary follicle-stimulating hormone (FSH) synthesis, 2) mechanisms of gonadotropin-releasing hormone (GnRH) signaling in pituitary gonadotrope cells, and 3) hypothalamic-pituitary control of thyroid hormone production.",
    "Topic Tag": "Endocrinology, FSH, LH",
    "Skills Tag": ""
  },
  {
    "id": 2,
    "name": "Derek Bowie",
    "title": "Professor",
    "address": "Bellini Life Sciences Complex\n3649 Prom. Sir-William-Osler, Room 164\nMontreal, QC, H3G 0B1",
    "tel": "514-398-1581",
    "fax": "",
    "email": "derek.bowie@mcgill.ca",
    "site": "http://www.medicine.mcgill.ca/pharma/dbowielab/",
    "publications": "http://www.ncbi.nlm.nih.gov/pubmed?term=%28%22bowie%20d%22%29%20AND%20%28%221991%22[Date%20-%20Publication]%20%3A%20%223000%22[Date%20-%20Publication]%29",
    "education": "Dr. Derek Bowie earned his doctorate from the University of London, held postdoctoral fellow positions at the Université Louis Pasteur (France), University of Zurich (Switzerland) and the National Institutes of Health (USA) before joining the faculty at Emory University in Atlanta. He joined McGill in 2002 and is currently a Full Professor and Director of GEPROM, a FRQS-funded research group of McGill, Concordia and Université de Montréal. He serves/served on the editorial boards of several periodicals (e.g. Journal of Physiology, Current Neuropharmacology, European Journal of Neuroscience).",
    "research": "The Bowie Lab studies the two major neurotransmitter receptors of the brain, namely ionotropic glutamate receptors and GABA-A receptors. Both receptor families are widespread in the vertebrate brain and fulfill many important roles in healthy individuals as well as being implicated in disease states (e.g. autism, epilepsy, Alzheimer's disease). These receptors are studied to understand how they shape neuronal circuit behaviour and how they may be targeted to treat CNS disease.",
    "Topic Tag": "",
    "Skills Tag": ""
  },
  {
    "id": 3,
    "name": "Paul Clarke",
    "title": "Professor",
    "address": "McIntyre Medical Sciences Building\n3655 Prom. Sir-William-Osler\nRoom 1315\nMontreal, QC, H3G 1Y6",
    "tel": "514-398-3616",
    "fax": "514-398-2045",
    "email": "paul.clarke@mcgill.ca",
    "site": "",
    "publications": "https://pubmed.ncbi.nlm.nih.gov/?term=Clarke+PB%5BAuthor%5D+NOT+Villalba%5BAuthor%5D+NOT+McGibney%5BAuthor%5D+NOT+3716140%5BPMID%5D+1983%3A2030%5Bdp%5D&sort=date",
    "education": "",
    "research": "After a childhood in Africa, I was educated in England (MA Cambridge, PhD Kings College London) and received postdoctoral training at NIMH (Bethesda, USA) and UBC.\n\nAddiction research: The cigarette habit is still one of the leading causes of death and disease worldwide, and drugs designed to aid smoking cessation are largely ineffective. Nicotine's role in tobacco addiction is both insidious and puzzling; for example, unlike drugs such as heroin and cocaine, nicotine is only a weak positive reinforcer. We believe that standard animal models do not fully capture the smoking-relevant effects of nicotine, and we are seeking to create better models in order to probe behavioural and pharmacological mechanisms that contribute to tobacco addiction.\n\nRat ultrasonic vocalizations:  Rats seem silent to us, but they are in fact quite vocal - but at frequencies beyond our hearing range. These animals emit a wide variety of ultrasonic (20-80 kHz) vocalizations, and our research suggests that some specific kinds of vocalizations reflect the rat's affective (mood) state. As such, ultrasonic vocalizations potentially provide a valuable complement to standard behavioural tests of motivation, and we think that they could prove useful in improved animal models related to addiction, mania and depression.\n\nIn vivo biosensors:  We are also starting to apply biosensors in living rodents, using fibre photometry to record intracellular activity. This project is in collaboration with my colleague Prof. Terence Hébert",
    "Topic Tag": "Nicotine, Addiction, Rat vocalization",
    "Skills Tag": "Assays, animal handling"
  },
  {
    "id": 4,
    "name": "Claudio Cuello",
    "title": "Professor and former Chair",
    "address": "McIntyre Medical Sciences Building\n3655 Promenade Sir William Osler\nRoom 1210\nMontreal, QC, H3G 1Y6",
    "tel": "514-398-3618",
    "fax": "514-398-8317",
    "email": "claudio.cuello@mcgill.ca",
    "site": "https://www.cuellolab.com/",
    "publications": "http://www.ncbi.nlm.nih.gov/pubmed?term=cuello%20ac",
    "education": "Professor Cuello has been trained at the Universities of Buenos Aires (UBA, Argentina), U. C. San Francisco (USA) and Cambridge (England). He held research and academic positions in the Department of Cell Biology at UBA and in the Department of Pharmacology at both Cambridge and Oxford. He is a past Chair of the McGill Department of Pharmacology and Therapeutics and presently holds the Charles E. Frosst Merck Chair within the same Department. He is also currently an Associate Member of the Departments of Anatomy and Cell Biology and Neurology and Neurosurgery at McGill University, adjunct Professor of the Scripps Institute (LaJolla) and Visiting Professor at Oxford University.",
    "research": "Dr Cuello’s lab is interested in degenerative and regenerative processes in the CNS with particular emphasis on aging and Alzheimer’s disease (AD) related studies. His lab utilizes and develops transgenic animal models presenting features of the AD neuropathology. The research is of a multidisciplinary nature ranging from molecular approaches to whole animal experimentation and with a particular interest in Alzheimer’s Therapeutics.",
    "Topic Tag": "",
    "Skills Tag": ""
  },
  {
    "id": 5,
    "name": "Barbara Hales",
    "title": "Professor",
    "address": "McIntyre Medical Sciences Building",
    "tel": "514-398-3610",
    "fax": "",
    "email": "barbara.hales@mcgill.ca",
    "site": "https://www.mcgill.ca/haleslab/",
    "publications": "https://pubmed.ncbi.nlm.nih.gov/?term=hales%20bf",
    "education": "",
    "research": "Birth defects occur in 2-4% of the children in North America, yet the causes of most of these malformations remain unknown. The overall goal of our research is to elucidate the mechanisms(s) underlying the developmental toxicity of environmental chemicals and drugs. We use a combination of in vivo, in vitro, and molecular approaches to elucidate the effects of model teratogens on signaling pathways that play important roles in normal development.  In collaboration with Bernard Robaire, we are exploring the consequences of paternal exposure to anticancer agents on male germ cell integrity and on epigenetic programming in early embryos. Finally, we are working with teams of researchers to evaluate the impact of exposure to “green” replacement plasticizers on the developing and adult testis and to determine the effects of chronic exposure to the environmentally relevant mixture of brominated flame retardants found in North American house dust on reproduction and development.",
    "Topic Tag": "",
    "Skills Tag": ""
  },
  {
    "id": 6,
    "name": "Terry Hébert",
    "title": "Professor",
    "address": "McIntyre Medical Sciences Building",
    "tel": "514-398-1398",
    "fax": "",
    "email": "terence.hebert@mcgill.ca",
    "site": "http://www.medicine.mcgill.ca/pharma/hebertlab/",
    "publications": "https://pubmed.ncbi.nlm.nih.gov/?term=hebert%20te",
    "education": "",
    "research": "Research in my lab is centered broadly around the theme of G protein-coupled signal transduction systems. These signalling systems are activated by agonists that bind to G protein-coupled receptors (GPCRs) leading to the regulation of effector proteins (e.g. enzymes and ion channels) by a transducer. We are interested in 1) basic mechanisms of how these signalling systems are wired, 2) novel signalling complexes and pathways associated with alternative subcellular localization of GPCRs and 3) the roles that these architectural features of signalling complex design might play in cardiac disease with a particular emphasis on congenital heart disease. More recently, my group has also become interested in how novel allosteric regulators of these receptors might be developed and tested, here with a focus on inflammatory mediators, their receptors and their roles in health and disease. I have also been investigating basic mechanisms of GPCR regulation, developing functional assays amenable to scaling up and for use as screens for novel modulators of the interactions within GPCR signalling complexes. All of the projects are currently funded.",
    "Topic Tag": "",
    "Skills Tag": ""
  },
  {
    "id": 7,
    "name": "Dusica Maysinger",
    "title": "Professor",
    "address": "McIntyre Medical Sciences Building",
    "tel": "514-398-1264",
    "fax": "",
    "email": "dusica.maysinger@mcgill.ca",
    "site": "http://www.medicine.mcgill.ca/pharma/dmaysingerlab/",
    "publications": "https://pubmed.ncbi.nlm.nih.gov/?term=maysinger%20d",
    "education": "Doctorate (PhD) University of Southern California, Los Angeles, USA; Postdoctoral training in neurochemistry at the Max-Planck-Institute, Munchen, Germany, University of Oxford,UK, McGill University, Canada. Other professional training: Karolinska Institut, Stockholm, Sweden (microdialysis); Cell Biology and Anatomy, Heidelberg, Germany (neuroscience).",
    "research": "The “leitmotiv\" of my research is the establishment of nanoparticles-based diagnostics and nano-delivery systems for therapeutic agents that will promote cell survival, neuronal growth and differentiation. I am particularly interested in the mechanisms that underlie the nanoparticle-cell interactions and signaling pathways involved in these processes. In the last several years our focus has been on the role of glia, particularly microglia, in the elimination OF nanostructured materials from, and their delivery to, sites of injury. We anticipate that our cell biological investigations of drug-polymer-cell interactions will have biomedical applications, especially in the fields of diagnosis and treatment. My main scientific contributions are in revealing the mechanisms of cell death by nanostructures and roles of organelles in cell adaptation and functional repair.",
    "Topic Tag": "",
    "Skills Tag": ""
  },
  {
    "id": 8,
    "name": "Anne McKinney",
    "title": "Professor",
    "address": "Bellini Life Sciences Complex\n3649 Prom. Sir-William-Osler, Room 164\nMontreal, QC, H3G 0B1",
    "tel": "514-398-5685",
    "fax": "",
    "email": "anne.mckinney@mcgill.ca",
    "site": "",
    "publications": "https://pubmed.ncbi.nlm.nih.gov/?term=%28McKinney%20RA[Author]%29%20AND%20%28%221996%22[Date%20-%20Publication]%20%3A%20%223000%22[Date%20-%20Publication]%29",
    "education": "Dr. Anne McKinney obtained her Ph.D, at the University of Ulster in 1992. She then spent the next 5 years in the Department of Neurophysiology at the Brain Research Institute, University of Zurich as a postdoctoral fellow. In 1998 she obtained her own group at the Brain Research Institute. She joined the Department of Pharmacology and Therapeutics in 2005.",
    "research": "Dr. McKinney’s principle research interest is the mechanisms involved in development and maintenance of excitatory synapses in the CNS, during physiological and pathological conditions, such as epilepsy and mental retardation. The synaptogenesis and maintenance of synaptic structures, key issues in neuroscience, are still poorly understood despite intensive research efforts. Her group’s studies are concentrated on the hippocampus, a brain region thought to be involved in learning and memory. The McKinney lab is using a combination of techniques including, 4-dimensional confocal laser scanning microscopy, serial electron microscopy, transgenic animals and electrophysiological techniques to investigate the structure and function of dendritic spines and their synapses.",
    "Topic Tag": "",
    "Skills Tag": ""
  },
  {
    "id": 9,
    "name": "Alfredo Ribeiro-da-Silva",
    "title": "Professor",
    "address": "McIntyre Medical Sciences Building",
    "tel": "514-398-3619",
    "fax": "",
    "email": "alfredo.ribeirodasilva@mcgill.ca",
    "site": "",
    "publications": "https://pubmed.ncbi.nlm.nih.gov/?term=ribeiro-da-silva",
    "education": "",
    "research": "Dr. Ribeiro-da-Silva received his MD and PhD in Porto, Potugal. His main research interest is the unravelling of the mechanisms underlying chronic pain, both in the central and peripheral nervous systems. He is particularly interested in animal models of arthritis pain and of neuropathic pain. Methods used in his lab include: immunocytochemistry at the light and electron microscopic levels, animal behaviour testing, and neurochemistry. He uses advanced tools such as replication deficient viral vectors to study synaptic circuits in the spinal cord and their changes in pain states. He is also the investigating the effects of modulating the endogenous levels of neurotrophic factors as a potential therapeutic approach for arthritis and neuropathic pain. He is a core member of the Alan Edwards Centre for Research on Pain and an investigator of the Quebec Pain Research Network (QPRN).",
    "Topic Tag": "",
    "Skills Tag": ""
  },
  {
    "id": 10,
    "name": "Bernard Robaire",
    "title": "Professor",
    "address": "McIntyre Medical Sciences Building",
    "tel": "514-398-3630",
    "fax": "",
    "email": "bernard.robaire@mcgill.ca",
    "site": "https://www.mcgill.ca/robairelab/",
    "publications": "https://pubmed.ncbi.nlm.nih.gov/?term=robaire%20b",
    "education": "",
    "research": "Bernard Robaire completed his studies at UCLA, McGill and Johns Hopkins before joining the academic staff at McGill where he is now a James McGill Professor, and is appointed in the Departments of Pharmacology & Therapeutics and of Obstetrics & Gynaecology.  His research interests focus on the effects of environmental toxicants on male reproduction, on male mediated reproductive toxicology, on the structure, function and regulation of the epididymis, on androgen action, and on aging of the male reproductive system. This research activity has resulted in over 200 journal articles and book chapters, and editing/co-editing ten books.",
    "Topic Tag": "Endocrine disruption",
    "Skills Tag": "Cell ssorting"
  },
  {
    "id": 11,
    "name": "Uri Saragovi",
    "title": "Professor",
    "address": "Lady Davis Institute",
    "tel": "514-340-8222 ext. 25055",
    "fax": "",
    "email": "uri.saragovi@mcgill.ca",
    "site": "",
    "publications": "https://pubmed.ncbi.nlm.nih.gov/?term=saragovi+hu",
    "education": "",
    "research": "Research in my laboratory focuses on understanding macromolecular structure function relationships, particularly in receptor-ligand interactions.\n\nWe have contributed towards the development of protein mimicry technology (reviewed in Nature Biotechnology, 10: 773; Immunomethods 1: 3-12). Using molecular design, biochemistry, and molecular biology techniques large proteins may be dissected to their smallest functional units. These approaches can be adapted for rational drug design and the development of agonists and antagonists.",
    "Topic Tag": "",
    "Skills Tag": ""
  },
  {
    "id": 12,
    "name": "Moshe Szyf",
    "title": "Professor",
    "address": "McIntyre Medical Sciences Building",
    "tel": "514-398-4400 ext. 00595",
    "fax": "",
    "email": "moshe.szyf@mcgill.ca",
    "site": "http://www.medicine.mcgill.ca/pharma/mszyflab/",
    "publications": "https://pubmed.ncbi.nlm.nih.gov/?term=szyf+m",
    "education": "",
    "research": "Szyf received his Ph. D from the Hebrew University and did his postdoctoral fellowship in Genetics at Harvard Medical School, joined the department in 1989 and currently holds a James McGill Professorship and GlaxoSmithKline-CIHR Chair in Pharmacology. He is the founding co-director of the Sackler Institute for Epigenetics and Psychobiology at McGill and is a Fellow of the Canadian Institute for Advanced Research Experience-based Brain and Biological Development program.  Szyf has been the founder of the first “Pharma” to develop epigenetic pharmacology “Methylgene Inc.” and the first journal in epigenetics “Epigenetics”.  Szyf lab has proposed two decades ago that DNA methylation is a prime therapeutic target in cancer and other diseases and has postulated and provided the first set of evidence that the “social environment” early in life can alter DNA methylation launching the emerging field of “social epigenetics”.",
    "Topic Tag": "",
    "Skills Tag": ""
  },
  {
    "id": 13,
    "name": "Jacquetta Trasler",
    "title": "Professor",
    "address": "MUHC",
    "tel": "514-934-1934 ext. 25235",
    "fax": "",
    "email": "jacquetta.trasler@mcgill.ca",
    "site": "",
    "publications": "https://pubmed.ncbi.nlm.nih.gov/?term=trasler+j",
    "education": "",
    "research": "Dr. Jacquetta Trasler is Director for Pediatric Research at the Research Institute of the McGill University Health Centre (RI-MUHC) and a James McGill Professor in Pediatrics, Human Genetics and Pharmacology & Therapeutics at McGill University. She directs the Developmental Genetics Laboratory at the RI-MUHC at the Montreal Children’s Hospital. Dr. Trasler has mentored a number of trainees and directed the McGill University M.D./Ph.D. Program from 1999-2007. Her research interests focus on epigenetics and the molecular and developmental regulation of gene expression in the germline and early embryo. More specifically she studies DNA methylation and genomic imprinting and the molecular and cellular targets for drug effects on germ cells and embryos. Ongoing studies include effects of drugs, diet (folate) and assisted reproductive technologies on the epigenome of germ cells and embryos and the implications for trangenerational passage of epigenetic defects.",
    "Topic Tag": "",
    "Skills Tag": ""
  },
  {
    "id": 14,
    "name": "Bastien Castagner",
    "title": "Associate Professor",
    "address": "McIntyre Medical Sciences Building",
    "tel": "514-398-2181",
    "fax": "",
    "email": "bastien.castagner@mcgill.ca",
    "site": "https://castagnerlab.com/",
    "publications": "https://pubmed.ncbi.nlm.nih.gov/?term=castagner+b",
    "education": "",
    "research": "Bastien Castagner obtained a Ph.D. in Chemistry at Columbia University in New York in 2004. His postdoctoral years were spent at ETH Zürich from 2005 - 2008. From 2009 - 2014 he was a Group Leader in the Institute of Pharmaceutical Sciences at ETH Zürich. He joined the Department of Pharmacology & Therapeutics at McGill in 2014 and was promoted to the rank of Associate Professor in 2020.\n\nDr. Castagner’s research focuses on the design of small-molecules and natural product analogues as novel drug candidates. He is especially interested in the chemistry and biology of inositol phosphates and carbohydrates. His group has been involved in novel strategies to inactivate the toxins responsible for the pathogenesis of Clostridioides difficile. He is also interested in the human gut microbiota and how molecules can impact its composition and metabolism, for the benefit of the host (us!).",
    "Topic Tag": "",
    "Skills Tag": ""
  },
  {
    "id": 15,
    "name": "Jason Tanny",
    "title": "Associate Professor",
    "address": "McIntyre Medical Sciences Building",
    "tel": "514-398-3608",
    "fax": "",
    "email": "jason.tanny@mcgill.ca",
    "site": "https://www.tannylab.org/",
    "publications": "https://pubmed.ncbi.nlm.nih.gov/?term=tanny%20jc",
    "education": "",
    "research": "I received my PhD in Cell and Developmental Biology from Harvard Medical School in 2003, and was a postdoctoral fellow at Rockefeller University (2003-2007) and at Université de Montréal (2007-2008). My lab studies gene regulation by covalent histone modifications and the impact of these mechanisms on human disease.  We focus on two general questions:  (1) How are histone modifications established at active genes?  (2) What are their functions in gene expression?  We use classical and chemical genetics, genomics, biochemistry, and proteomics approaches in yeast and mammalian model systems to elucidate the molecular functions of histone modifications. Our recent work has uncovered a novel link between ubiquitylation of histone H2B and the conserved transcription elongation factor P-TEFb. Ultimately, we aim to target histone modifications and relevant modifying enzymes to develop novel therapeutic avenues for a variety of diseases.",
    "Topic Tag": "",
    "Skills Tag": ""
  },
  {
    "id": 16,
    "name": "Lisa Munter",
    "title": "Associate Professor",
    "address": "Bellini Life Sciences Complex\n3649 Prom. Sir-William-Osler, Room 164\nMontreal, QC, H3G 0B1",
    "tel": "514-398-2159",
    "fax": "",
    "email": "lisa.munter@mcgill.ca",
    "site": "http://www.munterlab.com/",
    "publications": "https://www.ncbi.nlm.nih.gov/sites/myncbi/1LA5G-Y4A9K5k/bibliography/43902938/public/?sort=date&direction=descending",
    "education": "Dr. Lisa-Marie Munter obtained a Dr. rer. nat. degree in Biochemistry at the Freie Universität Berlin in 2007. Her postdoctoral years were spent at the University of Melbourne in the department of Pathology and the Freie Universität Berlin (2007-2012). She joined the department of Pharmacology at McGill University in August 2012.",
    "research": "My research interests focus around the molecular pathways leading to Alzheimer’s disease. Mutations in the amyloid precursor protein (APP) causatively link APP to Alzheimer’s disease, however, its physiological function is still incompletely understood. APP is cleaved by several proteases and we have identified a new, additional protease cleaving APP, i.e. the rhomboid-related protein 4 (RHBDL4). RHBDL4’s activity is regulated by cellular cholesterol levels, potentially linking this pathway to cholesterol as an established risk factor for Alzheimer’s disease. Furthermore, the cholesterol transporter apolipoprotein E variant 4 (ApoE4) is genetically causatively linked to Alzheimer’s disease, again an incompletely understood molecular pathway. My goals are to: 1) fully reveal the physiological function of APP utilizing the RHBDL4-mediated processing pathway, and 2) to understand cellular cholesterol distribution in the brain in relation to ApoE4 and other cholesterol-transporting proteins. My team utilizes appropriate cell culture and mouse models and a wide range of core facility tools available at McGill including mass spectrometry, fluorescent and electron microscopy, histology, FACS, the transgenic animal core, PET imaging and metabolomics. Our gained knowledge will inform us to develop new therapeutic strategies to prevent the onset of Alzheimer’s disease.",
    "Topic Tag": "",
    "Skills Tag": ""
  },
  {
    "id": 17,
    "name": "Jean-François Trempe",
    "title": "Associate Professor",
    "address": "McIntyre Medical Sciences Building",
    "tel": "514-398-6833",
    "fax": "",
    "email": "jeanfrancois.trempe@mcgill.ca",
    "site": "https://www.trempelab.org/",
    "publications": "https://pubmed.ncbi.nlm.nih.gov/?term=trempe%20jf",
    "education": "Dr Jean-François Trempe obtained a D.Phil. in Biochemistry at the University of Oxford in 2007. His postdoctoral years were spent at McGill University in the department of Biochemistry (2007-2010) and at the Montreal Neurological Institute (2010-2013). He joined the department of Pharmacology in August 2013.",
    "research": "My research interests are in the structure and function of proteins implicated in Parkinson’s disease, Parkin and PINK1 in particular. These proteins have been shown to mediate neuroprotection and mitochondrial maintenance through their enzymatic activities and post-translational modifications (PTMs): Parkin is an E3 ubiquitin ligase and PINK1 is a Ser/Thr kinase. My goals are to: 1) elucidate the composition and 3D structure of molecular complexes formed by Parkin and PINK1 on mitochondria, 2) develop novel therapies for PD based on these structures. My group will use the full range of structural biology tools available at McGill, such as X-ray crystallography, NMR spectroscopy, SAXS, electron microscopy and mass spectrometry, in order to obtain the most complete and highest resolution picture of complexes formed by PINK1 and Parkin. These structures will inform us on how these enzymes become active and modify their substrates, and will guide the development of novel pharmacological targets.",
    "Topic Tag": "Parkinson's Disease, Mitochondria Dysfunction",
    "Skills Tag": "NMR, X-ray crystallography, Mass spectrometry"
  },
  {
    "id": 18,
    "name": "Maureen McKeague",
    "title": "Assistant Professor",
    "address": "McIntyre Medical Sciences Building",
    "tel": "514-398-6338",
    "fax": "",
    "email": "maureen.mckeague@mcgill.ca",
    "site": "http://mckeague.lab.mcgill.ca/",
    "publications": "https://scholar.google.ca/citations?user=yW5Xxs8AAAAJ&hl=en",
    "education": "Assistant Professor Maureen McKeague obtained her PhD at Carleton University in 2012. She moved to the Department of Bioengineering at Stanford University from 2012-2016 for an NSERC postdoctoral fellowship, then transitioned to ETH Zurich for 2 years as a senior researcher in the Department of Health Sciences and Technology. She joined the Department of Pharmacology and Therapeutics in 2018 and is jointly appointed in the Department of Chemistry.",
    "research": "The McKeague lab is interested in defining the basis of chemotherapy resistance/sensitivity and to exploit these findings for patient stratification and the development of novel therapeutics. The lab employs a genomic chemistry approach that combines: (1) sequencing DNA damage distribution in the cancer genome; (2) characterizing DNA damage dynamics with real-time fluorescence monitoring; and (3) identifying novel DNA-based repair inhibitors",
    "Topic Tag": "",
    "Skills Tag": ""
  },
  {
    "id": 19,
    "name": "Ajitha Thanabalasuriar",
    "title": "Assistant Professor",
    "address": "McIntyre Medical Sciences Building",
    "tel": "514-398-7828",
    "fax": "",
    "email": "Ajitha.thanabalasuriar@mcgill.ca",
    "site": "",
    "publications": "https://pubmed.ncbi.nlm.nih.gov/?term=Thanabalasuriar",
    "education": "",
    "research": "The Thanabalasuriar Lab is focused on understanding the interplay between innate immune cells, the lung microbiota, and pulmonary infections. Using a combination of intricate in vivo models including intravital microscopy, my lab seeks to understand how innate immune cells mitigate infection control in the lung. Having experience in the drug development field during my time in the pharmaceutical company AstraZeneca, my research is tailored to developing novel new therapeutic targets.\n\nMy lab has three main research focuses:\n\n1. To understand and visualize the mechanisms of bacterial biofilm development in vivo.\n2. Determine the impact of the nasal microbiome on lung immunity.\n3. Understand the interplay between cutaneous thermal injury and airway inflammation.",
    "Topic Tag": "",
    "Skills Tag": ""
  }
]